espressif/esp-idf/components/soc/esp32h2/include/soc/pcr_struct.h
/** Type of ctrl_clk_out_en register
 *  CLK_OUT_EN configuration register
 */
typedef union {
    struct {
        /** clk8_oen : R/W; bitpos: [0]; default: 1;
         *  Set 1 to enable 8m clock
         */
        uint32_t clk8_oen:1;
        /** clk16_oen : R/W; bitpos: [1]; default: 1;
         *  Set 1 to enable 16m clock
         */
        uint32_t clk16_oen:1;
        /** clk32_oen : R/W; bitpos: [2]; default: 1;
         *  Set 1 to enable 32m clock
         */
        uint32_t clk32_oen:1;
        /** clk_adc_inf_oen : R/W; bitpos: [3]; default: 1;
         *  Reserved
         */
        uint32_t clk_adc_inf_oen:1;
        /** clk_dfm_inf_oen : R/W; bitpos: [4]; default: 1;
         *  Reserved
         */
        uint32_t clk_dfm_inf_oen:1;
        /** clk_sdm_mod_oen : R/W; bitpos: [5]; default: 1;
         *  Reserved
         */
        uint32_t clk_sdm_mod_oen:1;
        /** clk_xtal_oen : R/W; bitpos: [6]; default: 1;
         *  Set 1 to enable xtal clock
         */
        uint32_t clk_xtal_oen:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} pcr_ctrl_clk_out_en_reg_t;

/** Type of ctrl_tick_conf register
 *  TICK configuration register
 */
typedef union {
    struct {
        /** xtal_tick_num : R/W; bitpos: [7:0]; default: 39;
         *  ******* Description ***********
         */
        uint32_t xtal_tick_num:8;
        /** fosc_tick_num : R/W; bitpos: [15:8]; default: 7;
         *  ******* Description ***********
         */
        uint32_t fosc_tick_num:8;
        /** tick_enable : R/W; bitpos: [16]; default: 1;
         *  ******* Description ***********
         */
        uint32_t tick_enable:1;
        /** rst_tick_cnt : R/W; bitpos: [17]; default: 0;
         *  ******* Description ***********
         */
        uint32_t rst_tick_cnt:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} pcr_ctrl_tick_conf_reg_t;

/** Type of ctrl_32k_conf register
 *  32KHz clock configuration register
 */
typedef union {
    struct {
        /** 32k_sel : R/W; bitpos: [1:0]; default: 0;
         *  This field indicates which one 32KHz clock will be used by timergroup. 0:
         *  OSC32K(default), 1: XTAL32K, 2/3: 32KHz from pad GPIO0.
         */
        uint32_t 32k_sel:2;
        /** 32k_modem_sel : R/W; bitpos: [3:2]; default: 0;
         *  This field indicates which one 32KHz clock will be used by MODEM_SYSTEM. 0:
         *  OSC32K(default), 1: XTAL32K, 2/3: 32KHz from pad GPIO0.
         */
        uint32_t 32k_modem_sel:2;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_ctrl_32k_conf_reg_t;

/** Type of sram_power_conf_0 register
 *  HP SRAM/ROM configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:13;
        /** rom_force_pu : R/W; bitpos: [14:13]; default: 3;
         *  Set this bit to force power up ROM
         */
        uint32_t rom_force_pu:2;
        /** rom_force_pd : R/W; bitpos: [16:15]; default: 0;
         *  Set this bit to force power down ROM.
         */
        uint32_t rom_force_pd:2;
        /** rom_clkgate_force_on : R/W; bitpos: [18:17]; default: 0;
         *  1: Force to open the clock and bypass the gate-clock when accessing the ROM. 0: A
         *  gate-clock will be used when accessing the ROM.
         */
        uint32_t rom_clkgate_force_on:2;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} pcr_sram_power_conf_0_reg_t;

/** Type of sram_power_conf_1 register
 *  HP SRAM/ROM configuration register
 */
typedef union {
    struct {
        /** sram_force_pu : R/W; bitpos: [4:0]; default: 31;
         *  Set this bit to force power up SRAM
         */
        uint32_t sram_force_pu:5;
        uint32_t reserved_5:5;
        /** sram_force_pd : R/W; bitpos: [14:10]; default: 0;
         *  Set this bit to force power down SRAM.
         */
        uint32_t sram_force_pd:5;
        uint32_t reserved_15:10;
        /** sram_clkgate_force_on : R/W; bitpos: [29:25]; default: 0;
         *  1: Force to open the clock and bypass the gate-clock when accessing the SRAM. 0: A
         *  gate-clock will be used when accessing the SRAM.
         */
        uint32_t sram_clkgate_force_on:5;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} pcr_sram_power_conf_1_reg_t;

/** Type of sec_conf register
 *  xxxx
 */
typedef union {
    struct {
        /** sec_clk_sel : R/W; bitpos: [1:0]; default: 0;
         *  xxxx
         */
        uint32_t sec_clk_sel:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} pcr_sec_conf_reg_t;

/** Type of adc_inv_phase_conf register
 *  xxxx
 */
typedef union {
    struct {
        /** clk_adc_inv_phase_ena : R/W; bitpos: [0]; default: 0;
         *  xxxx
         */
        uint32_t clk_adc_inv_phase_ena:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} pcr_adc_inv_phase_conf_reg_t;

/** Type of sdm_inv_phase_conf register
 *  xxxx
 */
typedef union {
    struct {
        /** clk_sdm_inv_phase_ena : R/W; bitpos: [0]; default: 0;
         *  xxxx
         */
        uint32_t clk_sdm_inv_phase_ena:1;
        /** clk_sdm_inv_phase_sel : R/W; bitpos: [3:1]; default: 0;
         *  xxxx
         */
        uint32_t clk_sdm_inv_phase_sel:3;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_sdm_inv_phase_conf_reg_t;

/** Type of bus_clk_update register
 *  xxxx
 */
typedef union {
    struct {
        /** bus_clock_update : R/W/WTC; bitpos: [0]; default: 0;
         *  xxxx
         */
        uint32_t bus_clock_update:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} pcr_bus_clk_update_reg_t;

/** Type of sar_clk_div register
 *  xxxx
 */
typedef union {
    struct {
        /** sar2_clk_div_num : R/W; bitpos: [7:0]; default: 4;
         *  xxxx
         */
        uint32_t sar2_clk_div_num:8;
        /** sar1_clk_div_num : R/W; bitpos: [15:8]; default: 4;
         *  xxxx
         */
        uint32_t sar1_clk_div_num:8;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} pcr_sar_clk_div_reg_t;

/** Type of pwdet_sar_clk_conf register
 *  xxxx
 */
typedef union {
    struct {
        /** pwdet_sar_clk_div_num : R/W; bitpos: [7:0]; default: 7;
         *  xxxx
         */
        uint32_t pwdet_sar_clk_div_num:8;
        /** pwdet_sar_reader_en : R/W; bitpos: [8]; default: 1;
         *  xxxx
         */
        uint32_t pwdet_sar_reader_en:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} pcr_pwdet_sar_clk_conf_reg_t;

